# -*- coding: utf-8 -*-
"""Homework_lvl4_4.1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/15VbtTel3ENv7A5I23SlNcM3M2VwRStVE
"""

# Задача 4.1.
# Домашнее задание на SQL

# В базе данных teacher создайте таблицу Students

# Структура таблицы: Student_Id - Integer, Student_Name - Text, School_Id - Integer (Primary key)

import sqlite3

connection = sqlite3.connect('teatchers.db') 
cursor = connection.cursor() 
sqlquary = """CREATE TABLE Students (
Student_Id INTEGER NOT NULL,
Student_Name TEXT NOT NULL,
School_Count INTEGER NOT NULL
);"""

cursor.execute(sqlquary) 
connection.commit() 
connection.close()

# Наполните таблицу следующими данными:

# 201, Иван, 1
# 202, Петр, 2
# 203, Анастасия, 3
# 204, Игорь, 4

import sqlite3

connection = sqlite3.connect('teatchers.db')
cursor = connection.cursor() #назначили курсор
sqlquary = """INSERT INTO Students (Student_Id, Student_Name, School_Id)
VALUES('201', 'Иван', '1'),
('202', 'Петр', '2'),
('203', 'Анастасия', '3'),
('204',' Игорь', '4');"""

cursor.execute(sqlquary) 
connection.commit() 
connection.close()

# Напишите программу, с помощью которой по ID студента можно получать информацию о школе и студенте.

# Формат вывода:

# ID Студента:
# Имя студента:
# ID школы:
# Название школы:

import sqlite3

def get_connection():
  connection = sqlite3.connect('teatchers.db')
  return connection

def close_connection(connection):
  if connection:
    connection.close()

def get_student_inf(student_id):
  try:
    connection = get_connection()
    cursor = connection.cursor()
    sqlquery = """SELECT Students.student_id, Students.student_name, Students.school_id, School.school_name
    FROM Students
    JOIN School on Students.school_id = School.school_id
    Where student_id = ?"""
    cursor.execute(sqlquery,(student_id,))
    records = cursor.fetchall()
    close_connection(connection)
    return records
  except (Exception, sqlite3.Error) as error:
    print('Ошибка в получении данных', error)

student_id = input('Введите id студента: ')
stud_inf = get_student_inf(student_id)
print('Информация о студенте', '\n')
if stud_inf == []:
  print('Некорректный id')
else:
  for row in stud_inf:      
    print('ID Студента:', row[0])
    print('Имя студента:', row[1])
    print('ID школы:', row[2])
    print('Название школы:', row[3])